{
  "es": {
    "about_meta_title": "Sobre WifiHackX | Élite en Ciberseguridad",
    "about_meta_description": "Conoce al equipo, la misión y la visión de WifiHackX. Expertos en ciberseguridad WiFi a tu servicio.",
    "about_badge": "Ciberinteligencia Profesional",
    "about_heading": "Sobre WifiHackX",
    "about_status": "[ CONEXIÓN SEGURA ESTABLECIDA ]",
    "about_p1": "Somos un equipo de expertos en ciberseguridad inalámbrica, especializados en la auditoría y protección de redes WiFi.",
    "about_p2": "Nuestra misión es ofrecer herramientas profesionales, fiables y fáciles de usar para ayudar a empresas y particulares a identificar vulnerabilidades y fortalecer la seguridad de sus redes inalámbricas.",
    "about_p3": "Contamos con años de experiencia como especialistas en seguridad WiFi y auditores certificados, lo que nos permite desarrollar soluciones innovadoras y adaptadas a las necesidades reales del sector.",
    "about_p4": "En WifiHackX, creemos que la seguridad es un derecho y trabajamos cada día para que cualquier usuario, sin importar su nivel técnico, pueda proteger su información y navegar con tranquilidad.",
    "about_p5": "¿Tienes dudas o necesitas asesoramiento? Estamos aquí para ayudarte.",
    "about_back": "← Volver",
    "privacy_meta_title": "Política de Privacidad | WifiHackX",
    "privacy_meta_description": "Política de privacidad de WifiHackX. Información sobre el tratamiento de datos y la seguridad.",
    "privacy_badge": "Privacidad y Seguridad",
    "privacy_heading": "Política de Privacidad",
    "privacy_status": "[ PROTECCIÓN DE DATOS ACTIVA ]",
    "privacy_intro": "En WifiHackX protegemos tu información con estándares modernos de seguridad. Esta política explica qué datos se tratan, con qué finalidad y cuáles son tus derechos.",
    "privacy_no_store_title": "Datos que NO almacenamos",
    "privacy_no_store_text": "Esta plataforma no almacena correos electrónicos, cuentas bancarias, tarjetas de crédito ni información financiera sensible en sus servidores propios.",
    "privacy_data_title": "Datos que sí pueden tratarse",
    "privacy_data_text": "Podemos tratar identificadores técnicos (cookies, IP, identificadores de sesión) y métricas de uso con fines de seguridad, diagnóstico y mejora de la experiencia.",
    "privacy_purpose_title": "Finalidad del tratamiento",
    "privacy_purpose_text": "Los datos se usan para autenticación, prevención de fraude, soporte, analítica y funcionamiento de la plataforma. No vendemos datos personales.",
    "privacy_legal_title": "Base legal",
    "privacy_legal_text": "El tratamiento se basa en el interés legítimo, la ejecución del servicio y el consentimiento cuando sea necesario.",
    "privacy_providers_title": "Proveedores externos",
    "privacy_providers_text": "Podemos utilizar servicios de terceros (por ejemplo, hosting, analítica y pasarelas de pago). Dichos proveedores gestionan su propia información conforme a sus políticas.",
    "privacy_cookies_title": "Cookies y analítica",
    "privacy_cookies_text": "Usamos cookies técnicas y, si se habilita, analítica para medir uso del servicio. Puedes gestionar tus preferencias en cualquier momento.",
    "privacy_retention_title": "Conservación",
    "privacy_retention_text": "Conservamos los datos el tiempo necesario para los fines descritos y el cumplimiento de obligaciones legales.",
    "privacy_rights_title": "Derechos del usuario",
    "privacy_rights_text": "Puedes solicitar acceso, rectificación, supresión, oposición y limitación del tratamiento.",
    "privacy_security_title": "Seguridad",
    "privacy_security_text": "Aplicamos controles técnicos y organizativos para proteger la información frente a accesos no autorizados.",
    "privacy_contact_title": "Contacto",
    "privacy_contact_text_prefix": "Si tienes dudas sobre privacidad, contacta a",
    "privacy_contact_text_suffix": ".",
    "privacy_back": "← Volver",
    "terms_meta_title": "Términos de Servicio | WifiHackX",
    "terms_meta_description": "Términos de servicio de WifiHackX. Reglas de uso y responsabilidad.",
    "terms_badge": "Términos y Cumplimiento",
    "terms_heading": "Términos de Servicio",
    "terms_status": "[ USO RESPONSABLE REQUERIDO ]",
    "terms_intro": "Al usar WifiHackX aceptas estos términos. Las herramientas están destinadas a usos educativos y auditorías autorizadas.",
    "terms_responsible_title": "Uso responsable",
    "terms_responsible_text": "Está prohibido utilizar la plataforma para actividades ilegales, intrusiones no autorizadas o daño a terceros.",
    "terms_account_title": "Cuenta y acceso",
    "terms_account_text": "Eres responsable de la seguridad de tus credenciales y del uso que se haga de tu cuenta.",
    "terms_payments_title": "Pagos",
    "terms_payments_text": "Los pagos se procesan mediante proveedores externos. WifiHackX no almacena tarjetas ni datos bancarios.",
    "terms_ip_title": "Propiedad intelectual",
    "terms_ip_text": "El contenido, marca y software son propiedad de WifiHackX o de sus licenciantes. No está permitido su uso sin autorización.",
    "terms_liability_title": "Limitación de responsabilidad",
    "terms_liability_text": "WifiHackX no se responsabiliza por el uso indebido de las herramientas o la información proporcionada.",
    "terms_changes_title": "Modificaciones",
    "terms_changes_text": "Podemos actualizar estos términos. El uso continuado implica aceptación de los cambios.",
    "terms_back": "← Volver"
  },
  "en": {
    "about_meta_title": "About WifiHackX | Cybersecurity Excellence",
    "about_meta_description": "Meet the team, mission, and vision behind WifiHackX. Wireless cybersecurity experts at your service.",
    "about_badge": "Professional Cyber-Intelligence",
    "about_heading": "About WifiHackX",
    "about_status": "[ SECURE CONNECTION ESTABLISHED ]",
    "about_p1": "We are a team of wireless cybersecurity experts specialized in auditing and protecting WiFi networks.",
    "about_p2": "Our mission is to deliver professional, reliable, and easy-to-use tools that help companies and individuals identify vulnerabilities and strengthen the security of their wireless networks.",
    "about_p3": "We have years of experience as WiFi security specialists and certified auditors, enabling us to build innovative solutions tailored to real-world needs.",
    "about_p4": "At WifiHackX, we believe security is a right, and we work every day so any user—regardless of technical level—can protect their information and browse with confidence.",
    "about_p5": "Have questions or need guidance? We are here to help.",
    "about_back": "← Back",
    "privacy_meta_title": "Privacy Policy | WifiHackX",
    "privacy_meta_description": "WifiHackX privacy policy. Information about data handling and security.",
    "privacy_badge": "Privacy & Security",
    "privacy_heading": "Privacy Policy",
    "privacy_status": "[ DATA PROTECTION ACTIVE ]",
    "privacy_intro": "At WifiHackX, we protect your information with modern security standards. This policy explains what data is processed, for what purpose, and what your rights are.",
    "privacy_no_store_title": "Data We Do NOT Store",
    "privacy_no_store_text": "This platform does not store emails, bank accounts, credit cards, or sensitive financial information on its own servers.",
    "privacy_data_title": "Data That May Be Processed",
    "privacy_data_text": "We may process technical identifiers (cookies, IP, session identifiers) and usage metrics for security, diagnostics, and experience improvement.",
    "privacy_purpose_title": "Purpose of Processing",
    "privacy_purpose_text": "Data is used for authentication, fraud prevention, support, analytics, and platform operation. We do not sell personal data.",
    "privacy_legal_title": "Legal Basis",
    "privacy_legal_text": "Processing is based on legitimate interest, service performance, and consent when required.",
    "privacy_providers_title": "External Providers",
    "privacy_providers_text": "We may use third-party services (e.g., hosting, analytics, and payment gateways). These providers handle their own information under their policies.",
    "privacy_cookies_title": "Cookies and Analytics",
    "privacy_cookies_text": "We use technical cookies and, if enabled, analytics to measure service usage. You can manage your preferences at any time.",
    "privacy_retention_title": "Retention",
    "privacy_retention_text": "We keep data for as long as necessary for the purposes described and to comply with legal obligations.",
    "privacy_rights_title": "User Rights",
    "privacy_rights_text": "You may request access, rectification, deletion, objection, and restriction of processing.",
    "privacy_security_title": "Security",
    "privacy_security_text": "We apply technical and organizational controls to protect information against unauthorized access.",
    "privacy_contact_title": "Contact",
    "privacy_contact_text_prefix": "If you have privacy questions, contact",
    "privacy_contact_text_suffix": ".",
    "privacy_back": "← Back",
    "terms_meta_title": "Terms of Service | WifiHackX",
    "terms_meta_description": "WifiHackX terms of service. Usage rules and responsibility.",
    "terms_badge": "Terms & Compliance",
    "terms_heading": "Terms of Service",
    "terms_status": "[ RESPONSIBLE USE REQUIRED ]",
    "terms_intro": "By using WifiHackX you accept these terms. The tools are intended for educational use and authorized audits.",
    "terms_responsible_title": "Responsible Use",
    "terms_responsible_text": "Using the platform for illegal activities, unauthorized intrusions, or harm to third parties is prohibited.",
    "terms_account_title": "Account and Access",
    "terms_account_text": "You are responsible for the security of your credentials and for how your account is used.",
    "terms_payments_title": "Payments",
    "terms_payments_text": "Payments are processed by external providers. WifiHackX does not store card or banking data.",
    "terms_ip_title": "Intellectual Property",
    "terms_ip_text": "The content, brand, and software are the property of WifiHackX or its licensors. Use without authorization is not permitted.",
    "terms_liability_title": "Limitation of Liability",
    "terms_liability_text": "WifiHackX is not responsible for improper use of the tools or information provided.",
    "terms_changes_title": "Modifications",
    "terms_changes_text": "We may update these terms. Continued use implies acceptance of the changes.",
    "terms_back": "← Back"
  },
  "de": {
    "about_meta_title": "Über WifiHackX | Exzellenz in Cybersicherheit",
    "about_meta_description": "Lerne Team, Mission und Vision von WifiHackX kennen. Experten für WiFi-Cybersicherheit zu deinen Diensten.",
    "about_badge": "Professionelle Cyber-Intelligence",
    "about_heading": "Über WifiHackX",
    "about_status": "[ SICHERE VERBINDUNG HERGESTELLT ]",
    "about_p1": "Wir sind ein Team von Experten für drahtlose Cybersicherheit, spezialisiert auf Audits und den Schutz von WLAN-Netzwerken.",
    "about_p2": "Unsere Mission ist es, professionelle, zuverlässige und benutzerfreundliche Tools bereitzustellen, die Unternehmen und Privatpersonen dabei helfen, Schwachstellen zu identifizieren und die Sicherheit ihrer WLAN-Netzwerke zu stärken.",
    "about_p3": "Wir verfügen über jahrelange Erfahrung als WiFi-Sicherheitsspezialisten und zertifizierte Auditoren, wodurch wir innovative Lösungen entwickeln können, die auf reale Anforderungen zugeschnitten sind.",
    "about_p4": "Bei WifiHackX glauben wir, dass Sicherheit ein Recht ist, und arbeiten jeden Tag daran, dass jeder Nutzer – unabhängig vom technischen Niveau – seine Informationen schützen und mit Vertrauen surfen kann.",
    "about_p5": "Hast du Fragen oder brauchst Beratung? Wir sind für dich da.",
    "about_back": "← Zurück",
    "privacy_meta_title": "Datenschutzerklärung | WifiHackX",
    "privacy_meta_description": "Datenschutzerklärung von WifiHackX. Informationen zur Datenverarbeitung und Sicherheit.",
    "privacy_badge": "Datenschutz & Sicherheit",
    "privacy_heading": "Datenschutzerklärung",
    "privacy_status": "[ DATENSCHUTZ AKTIV ]",
    "privacy_intro": "Bei WifiHackX schützen wir deine Informationen mit modernen Sicherheitsstandards. Diese Richtlinie erklärt, welche Daten verarbeitet werden, zu welchem Zweck und welche Rechte du hast.",
    "privacy_no_store_title": "Daten, die wir NICHT speichern",
    "privacy_no_store_text": "Diese Plattform speichert keine E-Mails, Bankkonten, Kreditkarten oder sensible Finanzdaten auf eigenen Servern.",
    "privacy_data_title": "Daten, die verarbeitet werden können",
    "privacy_data_text": "Wir können technische Kennungen (Cookies, IP, Sitzungskennungen) und Nutzungsmetriken zu Sicherheits-, Diagnose- und Verbesserungszwecken verarbeiten.",
    "privacy_purpose_title": "Zweck der Verarbeitung",
    "privacy_purpose_text": "Daten werden für Authentifizierung, Betrugsprävention, Support, Analytik und den Betrieb der Plattform verwendet. Wir verkaufen keine personenbezogenen Daten.",
    "privacy_legal_title": "Rechtsgrundlage",
    "privacy_legal_text": "Die Verarbeitung beruht auf berechtigtem Interesse, der Vertragserfüllung und – falls erforderlich – deiner Einwilligung.",
    "privacy_providers_title": "Externe Anbieter",
    "privacy_providers_text": "Wir können Drittanbieter-Dienste nutzen (z. B. Hosting, Analytik, Zahlungsabwicklung). Diese Anbieter verarbeiten ihre eigenen Informationen gemäß ihren Richtlinien.",
    "privacy_cookies_title": "Cookies und Analytik",
    "privacy_cookies_text": "Wir verwenden technische Cookies und – falls aktiviert – Analytik, um die Nutzung des Dienstes zu messen. Du kannst deine Präferenzen jederzeit verwalten.",
    "privacy_retention_title": "Aufbewahrung",
    "privacy_retention_text": "Wir bewahren Daten so lange auf, wie es für die beschriebenen Zwecke und zur Erfüllung gesetzlicher Pflichten erforderlich ist.",
    "privacy_rights_title": "Rechte der Nutzer",
    "privacy_rights_text": "Du kannst Auskunft, Berichtigung, Löschung, Widerspruch und Einschränkung der Verarbeitung verlangen.",
    "privacy_security_title": "Sicherheit",
    "privacy_security_text": "Wir setzen technische und organisatorische Maßnahmen ein, um Informationen vor unbefugtem Zugriff zu schützen.",
    "privacy_contact_title": "Kontakt",
    "privacy_contact_text_prefix": "Bei Fragen zum Datenschutz kontaktiere",
    "privacy_contact_text_suffix": ".",
    "privacy_back": "← Zurück",
    "terms_meta_title": "Nutzungsbedingungen | WifiHackX",
    "terms_meta_description": "Nutzungsbedingungen von WifiHackX. Nutzungsregeln und Verantwortung.",
    "terms_badge": "Richtlinien & Compliance",
    "terms_heading": "Nutzungsbedingungen",
    "terms_status": "[ VERANTWORTUNGSVOLLE NUTZUNG ERFORDERLICH ]",
    "terms_intro": "Durch die Nutzung von WifiHackX akzeptierst du diese Bedingungen. Die Tools sind für Bildungszwecke und autorisierte Audits bestimmt.",
    "terms_responsible_title": "Verantwortungsvolle Nutzung",
    "terms_responsible_text": "Die Nutzung der Plattform für illegale Aktivitäten, unbefugte Zugriffe oder Schäden an Dritten ist untersagt.",
    "terms_account_title": "Konto und Zugriff",
    "terms_account_text": "Du bist für die Sicherheit deiner Zugangsdaten und die Nutzung deines Kontos verantwortlich.",
    "terms_payments_title": "Zahlungen",
    "terms_payments_text": "Zahlungen werden über externe Anbieter abgewickelt. WifiHackX speichert keine Karten- oder Bankdaten.",
    "terms_ip_title": "Geistiges Eigentum",
    "terms_ip_text": "Inhalte, Marke und Software sind Eigentum von WifiHackX oder dessen Lizenzgebern. Eine Nutzung ohne Genehmigung ist nicht erlaubt.",
    "terms_liability_title": "Haftungsbeschränkung",
    "terms_liability_text": "WifiHackX haftet nicht für den missbräuchlichen Einsatz der Tools oder der bereitgestellten Informationen.",
    "terms_changes_title": "Änderungen",
    "terms_changes_text": "Wir können diese Bedingungen aktualisieren. Die fortgesetzte Nutzung gilt als Zustimmung zu den Änderungen.",
    "terms_back": "← Zurück"
  },
  "fr": {
    "about_meta_title": "À propos de WifiHackX | Excellence en cybersécurité",
    "about_meta_description": "Découvrez l’équipe, la mission et la vision de WifiHackX. Experts en cybersécurité WiFi à votre service.",
    "about_badge": "Cyber-Intelligence Professionnelle",
    "about_heading": "À propos de WifiHackX",
    "about_status": "[ CONNEXION SÉCURISÉE ÉTABLIE ]",
    "about_p1": "Nous sommes une équipe d’experts en cybersécurité sans fil, spécialisés dans l’audit et la protection des réseaux WiFi.",
    "about_p2": "Notre mission est de fournir des outils professionnels, fiables et simples d’utilisation pour aider les entreprises et les particuliers à identifier les vulnérabilités et renforcer la sécurité de leurs réseaux sans fil.",
    "about_p3": "Nous avons des années d’expérience en tant que spécialistes de la sécurité WiFi et auditeurs certifiés, ce qui nous permet de développer des solutions innovantes adaptées aux besoins réels du secteur.",
    "about_p4": "Chez WifiHackX, nous croyons que la sécurité est un droit et nous travaillons chaque jour pour que tout utilisateur, quel que soit son niveau technique, puisse protéger ses informations et naviguer en toute confiance.",
    "about_p5": "Des questions ou besoin d’accompagnement ? Nous sommes là pour vous aider.",
    "about_back": "← Retour",
    "privacy_meta_title": "Politique de confidentialité | WifiHackX",
    "privacy_meta_description": "Politique de confidentialité de WifiHackX. Informations sur le traitement des données et la sécurité.",
    "privacy_badge": "Confidentialité & Sécurité",
    "privacy_heading": "Politique de confidentialité",
    "privacy_status": "[ PROTECTION DES DONNÉES ACTIVE ]",
    "privacy_intro": "Chez WifiHackX, nous protégeons vos informations avec des standards de sécurité modernes. Cette politique explique quelles données sont traitées, dans quel but et quels sont vos droits.",
    "privacy_no_store_title": "Données que nous ne stockons PAS",
    "privacy_no_store_text": "Cette plateforme ne stocke pas d’e-mails, de comptes bancaires, de cartes de crédit ni d’informations financières sensibles sur ses propres serveurs.",
    "privacy_data_title": "Données pouvant être traitées",
    "privacy_data_text": "Nous pouvons traiter des identifiants techniques (cookies, IP, identifiants de session) et des métriques d’usage à des fins de sécurité, de diagnostic et d’amélioration de l’expérience.",
    "privacy_purpose_title": "Finalité du traitement",
    "privacy_purpose_text": "Les données sont utilisées pour l’authentification, la prévention de la fraude, le support, l’analytique et le fonctionnement de la plateforme. Nous ne vendons pas de données personnelles.",
    "privacy_legal_title": "Base légale",
    "privacy_legal_text": "Le traitement est fondé sur l’intérêt légitime, l’exécution du service et le consentement lorsque nécessaire.",
    "privacy_providers_title": "Prestataires externes",
    "privacy_providers_text": "Nous pouvons utiliser des services tiers (ex. hébergement, analytique, passerelles de paiement). Ces prestataires gèrent leurs informations conformément à leurs politiques.",
    "privacy_cookies_title": "Cookies et analytique",
    "privacy_cookies_text": "Nous utilisons des cookies techniques et, si activé, de l’analytique pour mesurer l’usage du service. Vous pouvez gérer vos préférences à tout moment.",
    "privacy_retention_title": "Conservation",
    "privacy_retention_text": "Nous conservons les données pendant la durée nécessaire aux finalités décrites et au respect des obligations légales.",
    "privacy_rights_title": "Droits des utilisateurs",
    "privacy_rights_text": "Vous pouvez demander l’accès, la rectification, la suppression, l’opposition et la limitation du traitement.",
    "privacy_security_title": "Sécurité",
    "privacy_security_text": "Nous appliquons des contrôles techniques et organisationnels pour protéger les informations contre les accès non autorisés.",
    "privacy_contact_title": "Contact",
    "privacy_contact_text_prefix": "Pour toute question relative à la confidentialité, contactez",
    "privacy_contact_text_suffix": ".",
    "privacy_back": "← Retour",
    "terms_meta_title": "Conditions d’utilisation | WifiHackX",
    "terms_meta_description": "Conditions d’utilisation de WifiHackX. Règles d’usage et responsabilité.",
    "terms_badge": "Conditions & Conformité",
    "terms_heading": "Conditions d’utilisation",
    "terms_status": "[ USAGE RESPONSABLE REQUIS ]",
    "terms_intro": "En utilisant WifiHackX, vous acceptez ces conditions. Les outils sont destinés à un usage éducatif et à des audits autorisés.",
    "terms_responsible_title": "Usage responsable",
    "terms_responsible_text": "Il est interdit d’utiliser la plateforme pour des activités illégales, des intrusions non autorisées ou des dommages à des tiers.",
    "terms_account_title": "Compte et accès",
    "terms_account_text": "Vous êtes responsable de la sécurité de vos identifiants et de l’usage de votre compte.",
    "terms_payments_title": "Paiements",
    "terms_payments_text": "Les paiements sont traités par des prestataires externes. WifiHackX ne stocke pas les cartes ni les données bancaires.",
    "terms_ip_title": "Propriété intellectuelle",
    "terms_ip_text": "Le contenu, la marque et le logiciel sont la propriété de WifiHackX ou de ses concédants. Leur utilisation sans autorisation est interdite.",
    "terms_liability_title": "Limitation de responsabilité",
    "terms_liability_text": "WifiHackX n’est pas responsable d’un usage inapproprié des outils ou des informations fournies.",
    "terms_changes_title": "Modifications",
    "terms_changes_text": "Nous pouvons mettre à jour ces conditions. L’utilisation continue implique l’acceptation des changements.",
    "terms_back": "← Retour"
  },
  "it": {
    "about_meta_title": "Chi è WifiHackX | Eccellenza in cybersecurity",
    "about_meta_description": "Conosci il team, la missione e la visione di WifiHackX. Esperti di cybersecurity WiFi al tuo servizio.",
    "about_badge": "Cyber-Intelligence Professionale",
    "about_heading": "Chi è WifiHackX",
    "about_status": "[ CONNESSIONE SICURA STABILITA ]",
    "about_p1": "Siamo un team di esperti di cybersecurity wireless, specializzati nell’audit e nella protezione delle reti WiFi.",
    "about_p2": "La nostra missione è offrire strumenti professionali, affidabili e facili da usare per aiutare aziende e privati a individuare vulnerabilità e rafforzare la sicurezza delle loro reti wireless.",
    "about_p3": "Abbiamo anni di esperienza come specialisti di sicurezza WiFi e auditor certificati, che ci permettono di sviluppare soluzioni innovative e adattate alle esigenze reali del settore.",
    "about_p4": "In WifiHackX crediamo che la sicurezza sia un diritto e lavoriamo ogni giorno perché ogni utente, indipendentemente dal livello tecnico, possa proteggere le proprie informazioni e navigare con tranquillità.",
    "about_p5": "Hai dubbi o ti serve consulenza? Siamo qui per aiutarti.",
    "about_back": "← Indietro",
    "privacy_meta_title": "Informativa sulla privacy | WifiHackX",
    "privacy_meta_description": "Informativa sulla privacy di WifiHackX. Informazioni sul trattamento dei dati e sulla sicurezza.",
    "privacy_badge": "Privacy & Sicurezza",
    "privacy_heading": "Informativa sulla privacy",
    "privacy_status": "[ PROTEZIONE DATI ATTIVA ]",
    "privacy_intro": "In WifiHackX proteggiamo le tue informazioni con standard di sicurezza moderni. Questa informativa spiega quali dati vengono trattati, per quale finalità e quali sono i tuoi diritti.",
    "privacy_no_store_title": "Dati che NON conserviamo",
    "privacy_no_store_text": "Questa piattaforma non conserva email, conti bancari, carte di credito né informazioni finanziarie sensibili sui propri server.",
    "privacy_data_title": "Dati che possono essere trattati",
    "privacy_data_text": "Possiamo trattare identificatori tecnici (cookie, IP, identificatori di sessione) e metriche d’uso per finalità di sicurezza, diagnosi e miglioramento dell’esperienza.",
    "privacy_purpose_title": "Finalità del trattamento",
    "privacy_purpose_text": "I dati sono usati per autenticazione, prevenzione frodi, supporto, analisi e funzionamento della piattaforma. Non vendiamo dati personali.",
    "privacy_legal_title": "Base giuridica",
    "privacy_legal_text": "Il trattamento si basa sul legittimo interesse, sull’esecuzione del servizio e sul consenso quando necessario.",
    "privacy_providers_title": "Fornitori esterni",
    "privacy_providers_text": "Possiamo utilizzare servizi di terzi (ad es. hosting, analytics e gateway di pagamento). Tali fornitori gestiscono le loro informazioni secondo le proprie policy.",
    "privacy_cookies_title": "Cookie e analisi",
    "privacy_cookies_text": "Utilizziamo cookie tecnici e, se abilitata, analisi per misurare l’uso del servizio. Puoi gestire le tue preferenze in qualsiasi momento.",
    "privacy_retention_title": "Conservazione",
    "privacy_retention_text": "Conserviamo i dati per il tempo necessario alle finalità descritte e al rispetto degli obblighi legali.",
    "privacy_rights_title": "Diritti dell’utente",
    "privacy_rights_text": "Puoi richiedere accesso, rettifica, cancellazione, opposizione e limitazione del trattamento.",
    "privacy_security_title": "Sicurezza",
    "privacy_security_text": "Applichiamo controlli tecnici e organizzativi per proteggere le informazioni da accessi non autorizzati.",
    "privacy_contact_title": "Contatto",
    "privacy_contact_text_prefix": "Per dubbi sulla privacy, contatta",
    "privacy_contact_text_suffix": ".",
    "privacy_back": "← Indietro",
    "terms_meta_title": "Termini di servizio | WifiHackX",
    "terms_meta_description": "Termini di servizio di WifiHackX. Regole d’uso e responsabilità.",
    "terms_badge": "Termini & Conformità",
    "terms_heading": "Termini di servizio",
    "terms_status": "[ USO RESPONSABILE RICHIESTO ]",
    "terms_intro": "Usando WifiHackX accetti questi termini. Gli strumenti sono destinati a uso educativo e a audit autorizzati.",
    "terms_responsible_title": "Uso responsabile",
    "terms_responsible_text": "È vietato utilizzare la piattaforma per attività illegali, intrusioni non autorizzate o danni a terzi.",
    "terms_account_title": "Account e accesso",
    "terms_account_text": "Sei responsabile della sicurezza delle tue credenziali e dell’uso del tuo account.",
    "terms_payments_title": "Pagamenti",
    "terms_payments_text": "I pagamenti sono elaborati da fornitori esterni. WifiHackX non conserva carte o dati bancari.",
    "terms_ip_title": "Proprietà intellettuale",
    "terms_ip_text": "Contenuti, marchio e software sono di proprietà di WifiHackX o dei suoi licenzianti. L’uso senza autorizzazione non è consentito.",
    "terms_liability_title": "Limitazione di responsabilità",
    "terms_liability_text": "WifiHackX non è responsabile per l’uso improprio degli strumenti o delle informazioni fornite.",
    "terms_changes_title": "Modifiche",
    "terms_changes_text": "Possiamo aggiornare questi termini. L’uso continuato implica l’accettazione delle modifiche.",
    "terms_back": "← Indietro"
  },
  "pt": {
    "about_meta_title": "Sobre a WifiHackX | Excelência em cibersegurança",
    "about_meta_description": "Conheça a equipe, a missão e a visão da WifiHackX. Especialistas em cibersegurança WiFi ao seu serviço.",
    "about_badge": "Ciberinteligência Profissional",
    "about_heading": "Sobre a WifiHackX",
    "about_status": "[ CONEXÃO SEGURA ESTABELECIDA ]",
    "about_p1": "Somos uma equipe de especialistas em cibersegurança sem fio, especializados na auditoria e proteção de redes WiFi.",
    "about_p2": "Nossa missão é oferecer ferramentas profissionais, confiáveis e fáceis de usar para ajudar empresas e indivíduos a identificar vulnerabilidades e fortalecer a segurança de suas redes sem fio.",
    "about_p3": "Temos anos de experiência como especialistas em segurança WiFi e auditores certificados, o que nos permite desenvolver soluções inovadoras e adaptadas às necessidades reais do setor.",
    "about_p4": "Na WifiHackX, acreditamos que segurança é um direito e trabalhamos todos os dias para que qualquer usuário, independentemente do nível técnico, possa proteger suas informações e navegar com tranquilidade.",
    "about_p5": "Tem dúvidas ou precisa de orientação? Estamos aqui para ajudar.",
    "about_back": "← Voltar",
    "privacy_meta_title": "Política de privacidade | WifiHackX",
    "privacy_meta_description": "Política de privacidade da WifiHackX. Informações sobre tratamento de dados e segurança.",
    "privacy_badge": "Privacidade e Segurança",
    "privacy_heading": "Política de privacidade",
    "privacy_status": "[ PROTEÇÃO DE DADOS ATIVA ]",
    "privacy_intro": "Na WifiHackX, protegemos suas informações com padrões modernos de segurança. Esta política explica quais dados são tratados, com que finalidade e quais são seus direitos.",
    "privacy_no_store_title": "Dados que NÃO armazenamos",
    "privacy_no_store_text": "Esta plataforma não armazena e-mails, contas bancárias, cartões de crédito nem informações financeiras sensíveis em seus próprios servidores.",
    "privacy_data_title": "Dados que podem ser tratados",
    "privacy_data_text": "Podemos tratar identificadores técnicos (cookies, IP, identificadores de sessão) e métricas de uso para segurança, diagnóstico e melhoria da experiência.",
    "privacy_purpose_title": "Finalidade do tratamento",
    "privacy_purpose_text": "Os dados são usados para autenticação, prevenção a fraudes, suporte, análise e funcionamento da plataforma. Não vendemos dados pessoais.",
    "privacy_legal_title": "Base legal",
    "privacy_legal_text": "O tratamento se baseia no legítimo interesse, na execução do serviço e no consentimento quando necessário.",
    "privacy_providers_title": "Fornecedores externos",
    "privacy_providers_text": "Podemos utilizar serviços de terceiros (ex.: hospedagem, analytics e gateways de pagamento). Esses fornecedores tratam suas próprias informações conforme suas políticas.",
    "privacy_cookies_title": "Cookies e analytics",
    "privacy_cookies_text": "Usamos cookies técnicos e, se habilitado, analytics para medir o uso do serviço. Você pode gerenciar suas preferências a qualquer momento.",
    "privacy_retention_title": "Retenção",
    "privacy_retention_text": "Mantemos os dados pelo tempo necessário para as finalidades descritas e para cumprir obrigações legais.",
    "privacy_rights_title": "Direitos do usuário",
    "privacy_rights_text": "Você pode solicitar acesso, retificação, exclusão, oposição e limitação do tratamento.",
    "privacy_security_title": "Segurança",
    "privacy_security_text": "Aplicamos controles técnicos e organizacionais para proteger as informações contra acesso não autorizado.",
    "privacy_contact_title": "Contato",
    "privacy_contact_text_prefix": "Em caso de dúvidas sobre privacidade, entre em contato com",
    "privacy_contact_text_suffix": ".",
    "privacy_back": "← Voltar",
    "terms_meta_title": "Termos de serviço | WifiHackX",
    "terms_meta_description": "Termos de serviço da WifiHackX. Regras de uso e responsabilidade.",
    "terms_badge": "Termos e Conformidade",
    "terms_heading": "Termos de serviço",
    "terms_status": "[ USO RESPONSÁVEL EXIGIDO ]",
    "terms_intro": "Ao usar a WifiHackX, você aceita estes termos. As ferramentas destinam-se a usos educativos e auditorias autorizadas.",
    "terms_responsible_title": "Uso responsável",
    "terms_responsible_text": "É proibido utilizar a plataforma para atividades ilegais, invasões não autorizadas ou danos a terceiros.",
    "terms_account_title": "Conta e acesso",
    "terms_account_text": "Você é responsável pela segurança das suas credenciais e pelo uso da sua conta.",
    "terms_payments_title": "Pagamentos",
    "terms_payments_text": "Os pagamentos são processados por fornecedores externos. A WifiHackX não armazena cartões nem dados bancários.",
    "terms_ip_title": "Propriedade intelectual",
    "terms_ip_text": "O conteúdo, a marca e o software são propriedade da WifiHackX ou de seus licenciantes. O uso sem autorização não é permitido.",
    "terms_liability_title": "Limitação de responsabilidade",
    "terms_liability_text": "A WifiHackX não se responsabiliza pelo uso indevido das ferramentas ou das informações fornecidas.",
    "terms_changes_title": "Modificações",
    "terms_changes_text": "Podemos atualizar estes termos. O uso contínuo implica aceitação das alterações.",
    "terms_back": "← Voltar"
  },
  "ru": {
    "about_meta_title": "О WifiHackX | Экспертиза в кибербезопасности",
    "about_meta_description": "Познакомьтесь с командой, миссией и видением WifiHackX. Эксперты по WiFi-кибербезопасности к вашим услугам.",
    "about_badge": "Профессиональная киберразведка",
    "about_heading": "О WifiHackX",
    "about_status": "[ БЕЗОПАСНОЕ СОЕДИНЕНИЕ УСТАНОВЛЕНО ]",
    "about_p1": "Мы — команда экспертов по беспроводной кибербезопасности, специализирующаяся на аудите и защите WiFi-сетей.",
    "about_p2": "Наша миссия — предоставлять профессиональные, надежные и простые в использовании инструменты, которые помогают компаниям и частным лицам выявлять уязвимости и укреплять безопасность их беспроводных сетей.",
    "about_p3": "У нас многолетний опыт как специалистов по безопасности WiFi и сертифицированных аудиторов, что позволяет создавать инновационные решения, адаптированные к реальным потребностям отрасли.",
    "about_p4": "В WifiHackX мы считаем, что безопасность — это право, и работаем каждый день, чтобы любой пользователь, независимо от уровня подготовки, мог защитить свои данные и спокойно работать в сети.",
    "about_p5": "Есть вопросы или нужна консультация? Мы готовы помочь.",
    "about_back": "← Назад",
    "privacy_meta_title": "Политика конфиденциальности | WifiHackX",
    "privacy_meta_description": "Политика конфиденциальности WifiHackX. Информация об обработке данных и безопасности.",
    "privacy_badge": "Конфиденциальность и безопасность",
    "privacy_heading": "Политика конфиденциальности",
    "privacy_status": "[ ЗАЩИТА ДАННЫХ АКТИВНА ]",
    "privacy_intro": "В WifiHackX мы защищаем вашу информацию с использованием современных стандартов безопасности. Эта политика объясняет, какие данные обрабатываются, с какой целью и каковы ваши права.",
    "privacy_no_store_title": "Данные, которые мы НЕ храним",
    "privacy_no_store_text": "Эта платформа не хранит электронные адреса, банковские счета, кредитные карты или конфиденциальную финансовую информацию на собственных серверах.",
    "privacy_data_title": "Данные, которые могут обрабатываться",
    "privacy_data_text": "Мы можем обрабатывать технические идентификаторы (cookies, IP, идентификаторы сессии) и метрики использования для безопасности, диагностики и улучшения опыта.",
    "privacy_purpose_title": "Цели обработки",
    "privacy_purpose_text": "Данные используются для аутентификации, предотвращения мошенничества, поддержки, аналитики и работы платформы. Мы не продаем персональные данные.",
    "privacy_legal_title": "Правовое основание",
    "privacy_legal_text": "Обработка основана на законном интересе, выполнении услуги и согласии, когда это необходимо.",
    "privacy_providers_title": "Внешние поставщики",
    "privacy_providers_text": "Мы можем использовать сторонние сервисы (например, хостинг, аналитику и платежные шлюзы). Эти поставщики обрабатывают свои данные в соответствии со своими политиками.",
    "privacy_cookies_title": "Cookies и аналитика",
    "privacy_cookies_text": "Мы используем технические cookies и, при включении, аналитику для измерения использования сервиса. Вы можете управлять предпочтениями в любое время.",
    "privacy_retention_title": "Срок хранения",
    "privacy_retention_text": "Мы храним данные столько, сколько необходимо для описанных целей и выполнения юридических обязательств.",
    "privacy_rights_title": "Права пользователя",
    "privacy_rights_text": "Вы можете запросить доступ, исправление, удаление, возражение и ограничение обработки.",
    "privacy_security_title": "Безопасность",
    "privacy_security_text": "Мы применяем технические и организационные меры для защиты информации от несанкционированного доступа.",
    "privacy_contact_title": "Контакт",
    "privacy_contact_text_prefix": "По вопросам конфиденциальности обращайтесь",
    "privacy_contact_text_suffix": ".",
    "privacy_back": "← Назад",
    "terms_meta_title": "Условия использования | WifiHackX",
    "terms_meta_description": "Условия использования WifiHackX. Правила и ответственность.",
    "terms_badge": "Условия и соответствие",
    "terms_heading": "Условия использования",
    "terms_status": "[ ТРЕБУЕТСЯ ОТВЕТСТВЕННОЕ ИСПОЛЬЗОВАНИЕ ]",
    "terms_intro": "Используя WifiHackX, вы принимаете эти условия. Инструменты предназначены для учебных целей и авторизованных аудитов.",
    "terms_responsible_title": "Ответственное использование",
    "terms_responsible_text": "Запрещено использовать платформу для незаконной деятельности, несанкционированных вторжений или нанесения вреда третьим лицам.",
    "terms_account_title": "Аккаунт и доступ",
    "terms_account_text": "Вы несете ответственность за безопасность своих учетных данных и за использование своей учетной записи.",
    "terms_payments_title": "Платежи",
    "terms_payments_text": "Платежи обрабатываются внешними провайдерами. WifiHackX не хранит данные карт или банковских счетов.",
    "terms_ip_title": "Интеллектуальная собственность",
    "terms_ip_text": "Контент, бренд и программное обеспечение являются собственностью WifiHackX или ее лицензиаров. Использование без разрешения запрещено.",
    "terms_liability_title": "Ограничение ответственности",
    "terms_liability_text": "WifiHackX не несет ответственности за неправомерное использование инструментов или предоставленной информации.",
    "terms_changes_title": "Изменения",
    "terms_changes_text": "Мы можем обновлять эти условия. Продолжение использования означает согласие с изменениями.",
    "terms_back": "← Назад"
  },
  "zh": {
    "about_meta_title": "关于 WifiHackX | 网络安全卓越",
    "about_meta_description": "了解 WifiHackX 的团队、使命与愿景。您的 WiFi 网络安全专家。",
    "about_badge": "专业网络情报",
    "about_heading": "关于 WifiHackX",
    "about_status": "[ 已建立安全连接 ]",
    "about_p1": "我们是一支无线网络安全专家团队，专注于 WiFi 网络的审计与防护。",
    "about_p2": "我们的使命是提供专业、可靠且易用的工具，帮助企业和个人识别漏洞并强化其无线网络安全。",
    "about_p3": "我们拥有多年 WiFi 安全专家与认证审计的经验，使我们能够打造贴合行业真实需求的创新解决方案。",
    "about_p4": "在 WifiHackX，我们相信安全是一项权利，并每天努力让任何用户——无论技术水平如何——都能保护信息并安心上网。",
    "about_p5": "有疑问或需要指导？我们随时为您提供帮助。",
    "about_back": "← 返回",
    "privacy_meta_title": "隐私政策 | WifiHackX",
    "privacy_meta_description": "WifiHackX 隐私政策。关于数据处理与安全的信息。",
    "privacy_badge": "隐私与安全",
    "privacy_heading": "隐私政策",
    "privacy_status": "[ 数据保护已启用 ]",
    "privacy_intro": "在 WifiHackX，我们采用现代安全标准保护您的信息。本政策说明哪些数据被处理、处理目的以及您的权利。",
    "privacy_no_store_title": "我们不存储的数据",
    "privacy_no_store_text": "本平台不会在自有服务器上存储电子邮件、银行账户、信用卡或敏感财务信息。",
    "privacy_data_title": "可能处理的数据",
    "privacy_data_text": "我们可能处理技术标识符（cookies、IP、会话标识）及使用指标，用于安全、诊断和体验改进。",
    "privacy_purpose_title": "处理目的",
    "privacy_purpose_text": "数据用于身份验证、欺诈预防、支持、分析和平台运行。我们不出售个人数据。",
    "privacy_legal_title": "法律依据",
    "privacy_legal_text": "处理基于合法利益、服务履行以及在需要时的同意。",
    "privacy_providers_title": "外部服务提供商",
    "privacy_providers_text": "我们可能使用第三方服务（如托管、分析和支付网关）。这些服务商按照其自身政策处理信息。",
    "privacy_cookies_title": "Cookies 与分析",
    "privacy_cookies_text": "我们使用技术性 cookies，并在启用时使用分析以衡量服务使用情况。您可随时管理偏好。",
    "privacy_retention_title": "保留期限",
    "privacy_retention_text": "我们仅在实现上述目的及履行法律义务所需的期间保留数据。",
    "privacy_rights_title": "用户权利",
    "privacy_rights_text": "您可以请求访问、更正、删除、反对和限制处理。",
    "privacy_security_title": "安全",
    "privacy_security_text": "我们采取技术和组织措施防止未经授权的访问。",
    "privacy_contact_title": "联系",
    "privacy_contact_text_prefix": "如有隐私问题，请联系",
    "privacy_contact_text_suffix": "。",
    "privacy_back": "← 返回",
    "terms_meta_title": "服务条款 | WifiHackX",
    "terms_meta_description": "WifiHackX 服务条款。使用规则与责任。",
    "terms_badge": "条款与合规",
    "terms_heading": "服务条款",
    "terms_status": "[ 需要负责任的使用 ]",
    "terms_intro": "使用 WifiHackX 即表示您接受这些条款。工具仅用于教育用途和经授权的审计。",
    "terms_responsible_title": "负责任的使用",
    "terms_responsible_text": "禁止将平台用于非法活动、未经授权的入侵或对第三方造成损害。",
    "terms_account_title": "账户与访问",
    "terms_account_text": "您需对凭据安全及账户使用负责。",
    "terms_payments_title": "支付",
    "terms_payments_text": "支付由外部服务商处理。WifiHackX 不存储卡片或银行数据。",
    "terms_ip_title": "知识产权",
    "terms_ip_text": "内容、品牌与软件归 WifiHackX 或其许可方所有。未经授权不得使用。",
    "terms_liability_title": "责任限制",
    "terms_liability_text": "WifiHackX 不对工具或所提供信息的滥用负责。",
    "terms_changes_title": "变更",
    "terms_changes_text": "我们可能更新这些条款。继续使用即表示接受变更。",
    "terms_back": "← 返回"
  },
  "ja": {
    "about_meta_title": "WifiHackX について | サイバーセキュリティの卓越性",
    "about_meta_description": "WifiHackX のチーム、使命、ビジョンをご紹介します。WiFi サイバーセキュリティの専門家。",
    "about_badge": "プロフェッショナル・サイバーインテリジェンス",
    "about_heading": "WifiHackX について",
    "about_status": "[ セキュア接続を確立 ]",
    "about_p1": "私たちは無線サイバーセキュリティの専門チームで、WiFi ネットワークの監査と保護に特化しています。",
    "about_p2": "私たちの使命は、企業と個人が脆弱性を特定し、無線ネットワークの安全性を強化できるよう、プロフェッショナルで信頼性が高く、使いやすいツールを提供することです。",
    "about_p3": "WiFi セキュリティの専門家および認定監査人としての長年の経験により、業界の実ニーズに合わせた革新的なソリューションを開発しています。",
    "about_p4": "WifiHackX では、安全は権利であると考え、技術レベルに関係なく、誰もが情報を守り安心して利用できるよう日々取り組んでいます。",
    "about_p5": "ご不明点やご相談があれば、いつでもご連絡ください。",
    "about_back": "← 戻る",
    "privacy_meta_title": "プライバシーポリシー | WifiHackX",
    "privacy_meta_description": "WifiHackX のプライバシーポリシー。データ処理とセキュリティに関する情報。",
    "privacy_badge": "プライバシーとセキュリティ",
    "privacy_heading": "プライバシーポリシー",
    "privacy_status": "[ データ保護有効 ]",
    "privacy_intro": "WifiHackX は最新のセキュリティ基準で情報を保護します。本ポリシーは、処理されるデータ、その目的、そして利用者の権利を説明します。",
    "privacy_no_store_title": "保存しないデータ",
    "privacy_no_store_text": "本プラットフォームは、メールアドレス、銀行口座、クレジットカード、機微な金融情報を自社サーバーに保存しません。",
    "privacy_data_title": "処理される可能性のあるデータ",
    "privacy_data_text": "技術的識別子（cookie、IP、セッション識別子）や利用指標を、安全性、診断、体験向上の目的で処理する場合があります。",
    "privacy_purpose_title": "処理目的",
    "privacy_purpose_text": "データは認証、不正防止、サポート、分析、プラットフォーム運用のために使用されます。個人データを販売することはありません。",
    "privacy_legal_title": "法的根拠",
    "privacy_legal_text": "処理は正当な利益、サービス提供のための履行、必要な場合の同意に基づきます。",
    "privacy_providers_title": "外部プロバイダー",
    "privacy_providers_text": "当社は第三者サービス（ホスティング、分析、決済ゲートウェイなど）を利用する場合があります。これらの提供者は各自のポリシーに従って情報を扱います。",
    "privacy_cookies_title": "Cookie と分析",
    "privacy_cookies_text": "技術的な cookie を使用し、必要に応じて分析を有効化して利用状況を測定します。設定はいつでも管理できます。",
    "privacy_retention_title": "保存期間",
    "privacy_retention_text": "データは、記載された目的と法的義務の履行に必要な期間のみ保持します。",
    "privacy_rights_title": "利用者の権利",
    "privacy_rights_text": "アクセス、訂正、削除、異議申立て、処理の制限を要求できます。",
    "privacy_security_title": "セキュリティ",
    "privacy_security_text": "不正アクセスから情報を守るために技術的・組織的な対策を講じています。",
    "privacy_contact_title": "連絡先",
    "privacy_contact_text_prefix": "プライバシーに関するご質問は",
    "privacy_contact_text_suffix": "。",
    "privacy_back": "← 戻る",
    "terms_meta_title": "利用規約 | WifiHackX",
    "terms_meta_description": "WifiHackX の利用規約。利用ルールと責任。",
    "terms_badge": "規約とコンプライアンス",
    "terms_heading": "利用規約",
    "terms_status": "[ 責任ある利用が必要 ]",
    "terms_intro": "WifiHackX を利用することで本規約に同意したものとみなされます。ツールは教育用途および許可された監査を目的としています。",
    "terms_responsible_title": "責任ある利用",
    "terms_responsible_text": "違法行為、無許可の侵入、第三者への損害を目的とした利用は禁止されています。",
    "terms_account_title": "アカウントとアクセス",
    "terms_account_text": "認証情報の安全性およびアカウントの使用についてはお客様の責任となります。",
    "terms_payments_title": "支払い",
    "terms_payments_text": "支払いは外部プロバイダーが処理します。WifiHackX はカード情報や銀行情報を保存しません。",
    "terms_ip_title": "知的財産",
    "terms_ip_text": "コンテンツ、ブランド、ソフトウェアは WifiHackX またはライセンサーの所有物です。許可なく使用することはできません。",
    "terms_liability_title": "責任の制限",
    "terms_liability_text": "WifiHackX は、ツールや提供情報の不適切な使用について責任を負いません。",
    "terms_changes_title": "変更",
    "terms_changes_text": "当社は本規約を更新する場合があります。継続的な利用は変更への同意を意味します。",
    "terms_back": "← 戻る"
  },
  "ko": {
    "about_meta_title": "WifiHackX 소개 | 사이버보안 전문성",
    "about_meta_description": "WifiHackX의 팀, 미션, 비전을 소개합니다. WiFi 사이버보안 전문가.",
    "about_badge": "프로페셔널 사이버 인텔리전스",
    "about_heading": "WifiHackX 소개",
    "about_status": "[ 보안 연결 설정 완료 ]",
    "about_p1": "저희는 무선 사이버보안 전문가 팀으로, WiFi 네트워크 감사와 보호에 특화되어 있습니다.",
    "about_p2": "우리의 미션은 기업과 개인이 취약점을 식별하고 무선 네트워크 보안을 강화할 수 있도록 전문적이고 신뢰할 수 있으며 사용하기 쉬운 도구를 제공하는 것입니다.",
    "about_p3": "WiFi 보안 전문가 및 인증 감사자로서의 다년간의 경험을 바탕으로, 업계의 실제 요구에 맞춘 혁신적인 솔루션을 개발합니다.",
    "about_p4": "WifiHackX는 보안이 권리라고 믿으며, 기술 수준과 관계없이 모든 사용자가 정보를 보호하고 안심하고 인터넷을 사용할 수 있도록 매일 노력합니다.",
    "about_p5": "문의 사항이나 도움이 필요하신가요? 언제든지 도와드리겠습니다.",
    "about_back": "← 뒤로",
    "privacy_meta_title": "개인정보 처리방침 | WifiHackX",
    "privacy_meta_description": "WifiHackX 개인정보 처리방침. 데이터 처리 및 보안에 대한 정보.",
    "privacy_badge": "개인정보 및 보안",
    "privacy_heading": "개인정보 처리방침",
    "privacy_status": "[ 데이터 보호 활성화 ]",
    "privacy_intro": "WifiHackX는 현대적인 보안 표준으로 귀하의 정보를 보호합니다. 본 방침은 처리되는 데이터, 목적, 그리고 귀하의 권리를 설명합니다.",
    "privacy_no_store_title": "저장하지 않는 데이터",
    "privacy_no_store_text": "이 플랫폼은 이메일, 은행 계좌, 신용카드 또는 민감한 금융 정보를 자체 서버에 저장하지 않습니다.",
    "privacy_data_title": "처리될 수 있는 데이터",
    "privacy_data_text": "보안, 진단 및 사용자 경험 개선을 위해 기술적 식별자(쿠키, IP, 세션 식별자)와 사용 지표를 처리할 수 있습니다.",
    "privacy_purpose_title": "처리 목적",
    "privacy_purpose_text": "데이터는 인증, 사기 방지, 지원, 분석 및 플랫폼 운영에 사용됩니다. 개인 데이터를 판매하지 않습니다.",
    "privacy_legal_title": "법적 근거",
    "privacy_legal_text": "처리는 정당한 이익, 서비스 이행 및 필요한 경우 동의에 기반합니다.",
    "privacy_providers_title": "외부 제공업체",
    "privacy_providers_text": "당사는 제3자 서비스(예: 호스팅, 분석, 결제 게이트웨이)를 사용할 수 있습니다. 해당 제공업체는 자체 정책에 따라 정보를 처리합니다.",
    "privacy_cookies_title": "쿠키 및 분석",
    "privacy_cookies_text": "기술적 쿠키를 사용하며, 활성화된 경우 분석을 통해 서비스 사용을 측정합니다. 언제든지 선호 설정을 관리할 수 있습니다.",
    "privacy_retention_title": "보관 기간",
    "privacy_retention_text": "데이터는 설명된 목적과 법적 의무를 준수하기 위해 필요한 기간 동안 보관됩니다.",
    "privacy_rights_title": "사용자 권리",
    "privacy_rights_text": "접근, 정정, 삭제, 이의 제기 및 처리 제한을 요청할 수 있습니다.",
    "privacy_security_title": "보안",
    "privacy_security_text": "무단 접근으로부터 정보를 보호하기 위해 기술적·조직적 통제를 적용합니다.",
    "privacy_contact_title": "연락처",
    "privacy_contact_text_prefix": "개인정보 관련 문의는 다음으로 연락해 주세요",
    "privacy_contact_text_suffix": ".",
    "privacy_back": "← 뒤로",
    "terms_meta_title": "서비스 이용약관 | WifiHackX",
    "terms_meta_description": "WifiHackX 서비스 이용약관. 사용 규칙 및 책임.",
    "terms_badge": "약관 및 컴플라이언스",
    "terms_heading": "서비스 이용약관",
    "terms_status": "[ 책임 있는 사용 필요 ]",
    "terms_intro": "WifiHackX를 사용하면 본 약관에 동의하는 것으로 간주됩니다. 도구는 교육 목적 및 승인된 감사에 사용됩니다.",
    "terms_responsible_title": "책임 있는 사용",
    "terms_responsible_text": "불법 활동, 무단 침입 또는 제3자에게 피해를 주는 목적으로 플랫폼을 사용하는 것은 금지됩니다.",
    "terms_account_title": "계정 및 접근",
    "terms_account_text": "자격 증명의 보안과 계정 사용에 대한 책임은 사용자에게 있습니다.",
    "terms_payments_title": "결제",
    "terms_payments_text": "결제는 외부 제공업체가 처리합니다. WifiHackX는 카드 또는 은행 데이터를 저장하지 않습니다.",
    "terms_ip_title": "지적 재산권",
    "terms_ip_text": "콘텐츠, 브랜드 및 소프트웨어는 WifiHackX 또는 라이선서의 소유입니다. 허가 없이 사용할 수 없습니다.",
    "terms_liability_title": "책임 제한",
    "terms_liability_text": "WifiHackX는 도구 또는 제공된 정보의 부적절한 사용에 대해 책임지지 않습니다.",
    "terms_changes_title": "변경",
    "terms_changes_text": "약관은 업데이트될 수 있으며, 계속 사용하면 변경에 동의한 것으로 간주됩니다.",
    "terms_back": "← 뒤로"
  }
}
